using System;
// Клас с индексатор:
class MyClass
{
    // Частно целочислено поле:
    private int code;
    // Конструктор със символен аргумент:
    public MyClass(char s)
    {
        // Присвояване на стойност на полето:
        code = s;
    }

    // Символен индексатор с целочислен индекс:
    public char this[int k]
    {
        // Метод, извикван при четене стойността на израз
        // с индексиран обект:
        get
        {
            // Стойност на свойството:
            return (char)(code + k);
        }
        // Метод, извикван при присвояване стойност на
        // израз с индексиран обект:
        //set
        //{
        //    // Присвояване стойност на полето:
        //    code = value - k;
        //}
    }
}
// Клас с главен метод:
class MoreIndexerDemo
{
    // Главен метод:
    static void Main()
    {
        // Създаване на обект:
        MyClass obj = new MyClass('A');
        // Индексиране на обекта за четене на стойност:
        for (int k = 0; k < 10; k++)
        {
            Console.Write(obj[k] + " ");
        }
        Console.WriteLine();
        // Присвояване стойност на израз с индексиран обект:
        obj[5] = 'Q';
        // Индексиране на обекта за четене на стойност:
        for (int k = 0; k < 10; k++)
        {
            Console.Write(obj[k] + " ");
        }
        Console.WriteLine();
        // Използване на отрицателен индекс при
        // индексиране на обекта:
        for (int k = 0; k < 10; k++)
        {
            Console.Write(obj[-k] + " ");
        }
        Console.WriteLine();
    }
}